Table of Contents
 Class ReportSettings
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
Report settings for IDEA connections.
[DataContract]
public class ReportSettings
Inheritance
object
ReportSettings
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 CultureName
The name of the required culture of the report
[DataMember]
public string CultureName { get; set; }
Property Value
string
 Formulas
Indicates if formulas are in report
[DataMember]
public FormulasType Formulas { get; set; }
Property Value
FormulasType
 PlatesDrawings
Indicates, whether generate drawing of plates.
[DataMember]
public bool PlatesDrawings { get; set; }
Property Value
bool
 ReportType
Gets or sets the type of report.
[DataMember]
public ReportType ReportType { get; set; }
Property Value
ReportType
 ResultsPictures
Indicates, whether generate pictures of results.
[DataMember]
public bool ResultsPictures { get; set; }
Property Value
bool
 SymbolExplanations
Indicates, whether generate explanations to report.
[DataMember]
public bool SymbolExplanations { get; set; }
Property Value
bool
 TheoreticalBackground
Indicates, whether generate theoretical background.
[DataMember]
public bool TheoreticalBackground { get; set; }
Property Value
bool
 Unit
The name of the required culture of the report
[DataMember]
public UnitType Unit { get; set; }
Property Value
UnitType
 Views
Indicates, whether generate views (XY, XZ, YZ) into report.
[DataMember]
public bool Views { get; set; }
Property Value
bool
 Edit this page